app/controllers/users_controller.rb

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "name" = 'Nope', "password_digest" = '$2a$10$ECn1P8nvKQlkAM6Iv1yyUOIH7dXV5arMbS0G1hUTxfTV4Y7XKcceG', "remember_token" = 'W4cpQHNVIQfq4buDHQk0Cw', "updated_at" = '2013-05-07 18:38:09.938462' WHERE "users"."id" = 3